"""
Условия:
    1) Написать функцию get_rows_with_ten_numbers,
    в ход стоит необязательный аргумент, с числом необходимых значений, по умолчанию = 10.
     которая будет возвращать n произвольных чисел от 65 до 90 или от 48 до 57 записанных в одну строку с табуляцией(\t)
     в качестве разделителя.

    2) Создать файл "Матрица.txt", которая будет состоять из n различных строк(количество строк равно количеству чисел),
     полученных с помощью get_rows_with_ten_numbers
        Нужно сделать два варианты исполнения этого пункта:
            - Все данные должны быть записаны в файл единоразово.
            - Все данные файл должны быть записаны по мере поступления.
        Ничего кроме чисел, табуляций и переносов каретки в файле быть не должно


    Сопроводить все действия логирование.(делать print с информативными данными о том,
    какой процесс сейчас происходит)
"""
# Твой код:
