"""
Авторизоваться: запрос имя фамилия номр телефона
(После авторизации)
Посмотреть баланс, пополнить баланс, корзина, каталог
Посмотреть баланс: текущее состояни е счета в рублях
Пополнить баланс: пополнение на данную сумму ( с проверкой цифры)
Хотите зачислить на счет? (Да\нет)
Да-пополнение и доступные действия в виде инлайн клавы со всеми децствиями
Корзина-выбранные вещи Каждая новым сообщением) из каталога, количество кнопкой, стоимость позиции кнопкой, удалить из корзины кнопкой
в конце корзины пишется сообщение с суммарной стоимость и ниже кнопки Купить(проверка баланса, списать со счета деньги,
иначе предлагаем пополнить) Отмена(отмена заказа и доступные действия)
Каталог - Вылазят сообщения с доступными позициями: Батарея чугунная, алюминиевая, электрическая (с фотографиями)
у каждого сообщения кнопки добавить в корзину, убрать их корзины(меньше нуля упасть не может). При многочисленном нажатии- количесвто также растет
цена- текст
"""